# 2. Користувачем вводиться початковий і кінцевий рік.
#    Створити цикл, який виведе всі високосні роки в цьому проміжку (границі включно).
# Пояснення до завдання №2: високосний рік - це рік, який відповідає одному з двох наступних стверджень:
#  рік кратний 400
#  рік кратний 4, але не кратний 100
# Тобто, 2000 - високосний, бо, хоч він і не відповідає умові №2, але відповідає умові №1.
# Примітка: кратний - це коли остача від ділення дорівнює нулю.


def leap_years(begin, end):
    for i in range(begin, end + 1):
        if i % 4 == 0 and i % 100 != 0 or i % 400 == 0:
            print(i)


user_start = int(input("input first value"))
user_end = int(input("input last value"))
leap_years(user_start, user_end)
