# 7. Реалізуйте генератор, який приймає на вхід будь-яку ітерабельну послідовність (рядок, список, кортеж)
# і повертає генератор, який буде вертати значення з цієї послідовності,
# при цьому, якщо було повернено останній елемент із послідовності - ітерація починається знову.
#    Приклад (якщо запустили його у себе - натисніть Ctrl+C ;) ):


def my_generator(iterable):
    iter_len = len(iterable)
    i = 0
    while i < iter_len:
        yield iterable[i]
        i += 1
        if i == iter_len:
            i = 0


for i in my_generator(("рядок", "список", "кортеж")):
    print(i)
